In [1]:
import pandas as pd
import numpy as np

In [2]:
sozluk1 ={"Isim":["Ahmet","Mehmet","Zeynep","Atil",],
         "Spor":["Koşu","Yüzme","Koşu","Basketbol",],
         "Kalori":[100,250,200,300]}

In [14]:
dataFrame1 = pd.DataFrame(sozluk1,index = [0,1,2,3])

In [15]:
dataFrame1

     Isim       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     250
2  Zeynep       Koşu     200
3    Atil  Basketbol     300

In [16]:
sozluk2 ={"Isim":["Osman","Levent","Atlas","Fatma",],
         "Spor":["Koşu","Yüzme","Koşu","Basketbol",],
         "Kalori":[100,200,150,200]}

In [17]:
dataFrame2 = pd.DataFrame(sozluk2,index = [4,5,6,7])

In [18]:
dataFrame2

     Isim       Spor  Kalori
4   Osman       Koşu     100
5  Levent      Yüzme     200
6   Atlas       Koşu     150
7   Fatma  Basketbol     200

In [19]:
sozluk3 ={"Isim":["Ayse","Mahmut","Duygu","Nur",],
         "Spor":["Koşu","Yüzme","Badminton","Tenis",],
         "Kalori":[100,200,150,200]}

In [26]:
dataFrame3 = pd.DataFrame(sozluk3,index = [8,9,10,11])

In [27]:
dataFrame3

      Isim       Spor  Kalori
8     Ayse       Koşu     100
9   Mahmut      Yüzme     200
10   Duygu  Badminton     150
11     Nur      Tenis     200

## concatenation

In [29]:
pd.concat([dataFrame1,dataFrame2,dataFrame3],axis =0)

      Isim       Spor  Kalori
0    Ahmet       Koşu     100
1   Mehmet      Yüzme     250
2   Zeynep       Koşu     200
3     Atil  Basketbol     300
4    Osman       Koşu     100
5   Levent      Yüzme     200
6    Atlas       Koşu     150
7    Fatma  Basketbol     200
8     Ayse       Koşu     100
9   Mahmut      Yüzme     200
10   Duygu  Badminton     150
11     Nur      Tenis     200

axis=1 olursa da kolonlar birleştirilir.

## merge

In [34]:
mergeSozluk1 ={"Isim":["Ahmet","Mehmet","Zeynep","Atil",],
         "Spor":["Koşu","Yüzme","Koşu","Basketbol"]}

In [35]:
mergeDataFrame1 = pd.DataFrame(mergeSozluk1)

In [36]:
mergeDataFrame1

     Isim       Spor
0   Ahmet       Koşu
1  Mehmet      Yüzme
2  Zeynep       Koşu
3    Atil  Basketbol

In [41]:
mergeSozluk2 ={"Isim":["Ahmet","Mehmet","Zeynep","Atil",],
         "Kalori":[100,200,300,250]}

In [42]:
mergeDataFrame2 = pd.DataFrame(mergeSozluk2)

In [43]:
mergeDataFrame2

     Isim  Kalori
0   Ahmet     100
1  Mehmet     200
2  Zeynep     300
3    Atil     250

In [44]:
pd.merge(mergeDataFrame1,mergeDataFrame2,on ="Isim")

     Isim       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     300
3    Atil  Basketbol     250

## tips and tricks

In [59]:
maasSozluk = {"Isim":["Ahmet","Mehmet","Zeynep","Atil",],
         "Departman":["Yazılım","Satış","Pazarlama","Yazılım"],
             "Maas":[200,300,400,500]}

In [60]:
maasDataFrame = pd.DataFrame(maasSozluk)

In [61]:
maasDataFrame

     Isim  Departman  Maas
0   Ahmet    Yazılım   200
1  Mehmet      Satış   300
2  Zeynep  Pazarlama   400
3    Atil    Yazılım   500

In [62]:
maasDataFrame["Departman"].unique()

array(['Yazılım', 'Satış', 'Pazarlama'], dtype=object)

In [63]:
maasDataFrame["Departman"].nunique()

3

In [64]:
maasDataFrame["Departman"].value_counts()

Yazılım      2
Satış        1
Pazarlama    1
Name: Departman, dtype: int64

In [70]:
def bruttenNete(maas):
    return maas*0.66

In [71]:
maasDataFrame["Maas"]

0    200
1    300
2    400
3    500
Name: Maas, dtype: int64

In [72]:
maasDataFrame["Maas"].apply(bruttenNete)

0    132.0
1    198.0
2    264.0
3    330.0
Name: Maas, dtype: float64

In [73]:
maasDataFrame.isnull()

    Isim  Departman   Maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

## pivot table

In [103]:
yeniBirVeri = {"Karakter Sınıfı": ["South Park","South Park","Simpson","Simpson","Simpson"],
              "Karakter Ismi": ["Cartman","Kenny","Homer","Bart","Bart"],
              "Karakter Yas": [9,10,50,20,10]}

In [104]:
karakterDF = pd.DataFrame(yeniBirVeri)

In [105]:
karakterDF

  Karakter Sınıfı Karakter Ismi  Karakter Yas
0      South Park       Cartman             9
1      South Park         Kenny            10
2         Simpson         Homer            50
3         Simpson          Bart            20
4         Simpson          Bart            10

In [107]:
karakterDF.pivot_table(values ="Karakter Yas",index= ["Karakter Sınıfı","Karakter Ismi"],aggfunc =np.sum)

                               Karakter Yas
Karakter Sınıfı Karakter Ismi
Simpson         Bart                     30
                Homer                    50
South Park      Cartman                   9
                Kenny                    10